In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("ba_reviews.csv")

In [6]:
df.head()

,header,author,date,place,content,aircraft,traveller_type,seat_type,route,date_flown,recommended,trip_verified,rating,seat_comfort,cabin_staff_service,food_beverages,ground_service,value_for_money,entertainment
0,service was mediocre at best,Gary Storer,03/10/2023,United Kingdom,"Just returned from Chicago, flew out 10 days ...",A380,Couple Leisure,Economy Class,Chicago to Manchester via Heathrow,01/10/2023,no,Not Verified,2,2,3,1,2,2,-1
1,BA standards continue to decline,A Jensen,02/10/2023,United Kingdom,BA standards continue to decline every time ...,A320,Business,Business Class,London Heathrow to Munich,01/09/2023,no,Verified,2,2,1,2,1,1,-1
2,"won the race to the bottom""",John Rockett,02/10/2023,United Kingdom,Awful. Business class check in queue just as...,A320,Couple Leisure,Business Class,Heathrow to Istanbul,01/09/2023,no,Not Verified,2,2,3,2,1,1,-1
3,Not a reliable airline,Tatiana Bobrovskaya,02/10/2023,United Kingdom,Not a reliable airline. You cannot trust the...,A320,Business,Economy Class,London to Geneva,01/10/2023,no,Verified,3,4,4,2,1,1,-1
4,Very disappointed,Tom Slowbe,28/09/2023,United States,"The airplanes and the lounges are worn out, o...",777-300 and A320,Couple Leisure,First Class,Dallas to Dubrovnik via Heathrow,01/09/2023,no,Verified,1,1,4,4,3,2,3

In [10]:
df.shape

(1324, 19)

In [8]:
df.describe()

,rating,seat_comfort,cabin_staff_service,food_beverages,ground_service,value_for_money,entertainment
count,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000
mean,4.188822,2.870091,3.280211,2.381420,3.031722,2.777946,1.435801
std,3.253325,1.386049,1.520592,1.697979,1.405815,1.409587,2.096598
min,1.000000,-1.000000,-1.000000,-1.000000,-1.000000,1.000000,-1.000000
25%,1.000000,2.000000,2.000000,1.000000,2.000000,1.000000,-1.000000
50%,3.000000,3.000000,4.000000,2.000000,3.000000,3.000000,1.000000
75%,7.000000,4.000000,5.000000,4.000000,4.000000,4.000000,3.000000
max,10.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000

We see there are negative review ratings for certain categories, this is likely incorrect data. Hence, we will now explore what to do with such records depending on their frequency.

In [23]:
len(df[(df["seat_comfort"]==-1) |(df["cabin_staff_service"]==-1) | (df["food_beverages"]==-1) |\
    (df["ground_service"]==-1) | (df["entertainment"]==-1)])

465

In [25]:
465/1324

0.3512084592145015

This accounts for nearly 35% of the data and dropping these rows will lead to significant data loss. Hence, we will consider absolute values for each these columns

In [29]:
columns_to_update = ["seat_comfort", "cabin_staff_service", "food_beverages", "ground_service", "entertainment"]
df[columns_to_update] = df[columns_to_update].abs()

In [31]:
df.describe()

,rating,seat_comfort,cabin_staff_service,food_beverages,ground_service,value_for_money,entertainment
count,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000,1324.000000
mean,4.188822,2.886707,3.296828,2.532477,3.037764,2.777946,2.126133
std,3.253325,1.351074,1.484194,1.462973,1.392701,1.409587,1.391024
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,1.000000,2.000000,2.000000,1.000000,2.000000,1.000000,1.000000
50%,3.000000,3.000000,4.000000,2.000000,3.000000,3.000000,1.000000
75%,7.000000,4.000000,5.000000,4.000000,4.000000,4.000000,3.000000
max,10.000000,5.000000,5.000000,5.000000,5.000000,5.000000,5.000000

In [33]:
df.isna().any()

header                 False
author                 False
date                   False
place                  False
content                False
aircraft               False
traveller_type          True
seat_type              False
route                  False
date_flown             False
recommended            False
trip_verified          False
rating                 False
seat_comfort           False
cabin_staff_service    False
food_beverages         False
ground_service         False
value_for_money        False
entertainment          False
dtype: bool

In [35]:
df.isna().sum()

header                 0
author                 0
date                   0
place                  0
content                0
aircraft               0
traveller_type         1
seat_type              0
route                  0
date_flown             0
recommended            0
trip_verified          0
rating                 0
seat_comfort           0
cabin_staff_service    0
food_beverages         0
ground_service         0
value_for_money        0
entertainment          0
dtype: int64

Given it's only 1 row with a null value we can drop the row

In [42]:
df = df.dropna()

In [44]:
df.isna().sum()

header                 0
author                 0
date                   0
place                  0
content                0
aircraft               0
traveller_type         0
seat_type              0
route                  0
date_flown             0
recommended            0
trip_verified          0
rating                 0
seat_comfort           0
cabin_staff_service    0
food_beverages         0
ground_service         0
value_for_money        0
entertainment          0
dtype: int64

In [46]:
df.shape

(1323, 19)

we'll now save this df as a csv and use tableau to do further analysis.

In [48]:
df.to_csv("ba_reviews_cleaned.csv", index=False)